
nc: 16  # number of classes
scales:   # [depth, width, max_channels]
  B: [0.33, 0.50, 1024, 10]  # Mamba-YOLOv8-B summary:   21.8M parameters,  49.7 GFLOPs


# Mamba-YOLO backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]   # 0-P2/4            64, 64, 64
  - [-1, 3, DSE_SSM, [128]]               # 1          64, 64, 64
  - [-1, 1, VisionClueMerge, [256]]      # 2 p3/8       128, 32, 32
  - [-1, 3, DSE_SSM, [256]]              # 3           128, 32, 32
  - [-1, 1, VisionClueMerge, [512]]      # 4 p4/16      256, 16, 16
  - [-1, 9, DSE_SSM, [512]]              # 5           256, 16, 16
  - [-1, 1, VisionClueMerge, [1024]]      # 6 p5/32     512, 8, 8
  - [-1, 3, DSE_SSM, [1024]]              # 7          512, 8, 8
  - [-1, 1, SPPF, [1024, 5]]               # 8          512, 8, 8

# Mamba-YOLO PAFPN
head:
  - [3, 1, HyperComputeModule, [256]] # 9               128, 32, 32
  - [-1, 3, MANet, [256, True, 2, 3]] # 10              128, 32, 32
  - [5, 1, HyperComputeModule, [512]] # 11              256, 16, 16
  - [-1, 3, MANet, [512, True, 2, 3]] # 12              256, 16, 16
  # - [8, 1, HyperComputeModule, [1024]] # 13             512, 8, 8
  # - [-1, 3, MANet, [1024, True, 2, 3]] # 14             512, 8, 8

  - [8, 1, nn.Upsample, [None, 2, 'bilinear']]      #13 512, 16, 16 
  - [[-1, 12], 1, Concat, [1]]  # cat backbone P4   #14 768, 16, 16 
  - [-1, 3, DSE_SSM, [512]]  # 11    #15               256, 16, 16

  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]   #16    512, 32, 32
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P3   #17 640, 32, 32
  - [-1, 3, DSE_SSM, [256]]  # 14 (P3/8-small)   #18   128, 32, 32

  - [-1, 1, Conv, [256, 3, 2]]    #19                   256, 32, 32
  - [[-1, 15], 1, Concat, [1]]  # cat head P4   #20     512, 32, 32
  - [-1, 3, DSE_SSM, [512]]  # 17 (P4/16-medium)   #21 256, 16, 16

  - [-1, 1, Conv, [512, 3, 2]]    #22                  512, 8, 8
  - [[-1, 8], 1, Concat, [1]]  # cat head P5   #23
  - [-1, 3, DSE_SSM, [1024]]  # 20 (P5/32-large)   #24

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)


  